-- ---------------------------------------------------------------------------------------

START TRANSACTION;

-- ---------------------------------------------------------------------------------------

INSERT INTO "Core"."ModulePermission"
    ("IDModulePermission", "ModuleID", "Mark", "Name")
VALUES
    (
        DEFAULT,
        (
            SELECT
                "IDModule"
            FROM
                "Core"."Module"
            WHERE
                ("AccessKey" = 'statement')
        ),
        'can-view-payments',
        'Просмотр предоплат'
    );

-- ---------------------------------------------------------------------------------------

COMMIT;

-- ---------------------------------------------------------------------------------------