-- ---------------------------------------------------------------------------------------

ALTER TABLE "Core"."User"
    ADD COLUMN
        "ModuleID"
        INT
        NULL;

-- ---------------------------------------------------------------------------------------

COMMENT ON COLUMN
    "Core"."User"."ModuleID"
IS
    'Стартовый модуль - модуль отображаемый при входе, если указан.';

-- ---------------------------------------------------------------------------------------

CREATE INDEX
    "IDX_User_Module"
ON
    "Core"."User" ("ModuleID");

-- ---------------------------------------------------------------------------------------

ALTER TABLE "Core"."User"
    ADD CONSTRAINT "FK_User_Module"
        FOREIGN KEY ("ModuleID")
        REFERENCES "Core"."Module" ("IDModule")
            ON UPDATE CASCADE
            ON DELETE SET NULL;

-- ---------------------------------------------------------------------------------------